README.md

# Table of Contents

1.  [Nome do Software (ou Biblioteca):](#orge0a62a9)
2.  [Resumo e/ou informação extra:](#org32ae1d0)
3.  [Versão:](#org88f676b)
4.  [Data:](#orgd4d0250)
5.  [Autor de Contato:](#org1af77a8)
6.  [Lista dos Autores:](#org204c5d8)
7.  [Áreas de pesquisa vinculadas:](#org01fa11a)
8.  [Vinculo com:](#org5caae3d)
9.  [Paradigmas:](#orgd913721)
10. [Tipo de Interface:](#org6cd6f24)
11. [Plataformas Suportadas:](#org3b57d41)
12. [Linguagens Utilizadas:](#org25130dc)
13. [Bibliotecas Utilizadas (dependências):](#orgd4116ea)
14. [Softwares utilizados (dependências)](#org1089257)
15. [Tipo de Licença:](#org8cee9f0)
16. [Links:](#org424adf2)


<a id="orge0a62a9"></a>

# Nome do Software (ou Biblioteca):

-   SIMULADOR DE SOLUÇÕES ANALÍTICAS ADIMENSIONAIS DA

EQUAÇÃO DA DIFUSIVIDADE HIDRÁULICA PARA FLUXOS
LINEAR E RADIAL


<a id="org32ae1d0"></a>

# Resumo e/ou informação extra:

-   A partir da descoberta de uma acumulação de petróleo diversas informações podem

ser obtidas. Das mais importantes, pode-se citar como exemplo a quantidade de hidro-
carbonetos que se pode retirar dessa jazida e o tempo em que essa produção se efetuará.
Dentro da engenharia de petróleo, engenheiros de reservatório constantemente buscam
solucionar problemas envolvendo uxos monofásicos de uidos de baixa compressibilidade
que partem das as equações fundamentais da mecânica dos uidos que descrevem o trans-
porte de líquidos em meios porosos. A principal equação que rege esse estudo do uxo
em meios porosos é a Equação da Difusividade Hidráulica e ao resolver os problemas de
valor inicial e de contorno formados por essa equação, é possível obter os modelos físicos
de interesse que são encontrados no campo.
A necessidade de monitoramento do comportamento do reservatório é evidente e prever
como será o seu comportamento auxilia diretamente na tomada de decisões a respeito das
operações realizadas e serve de base para os testes de pressão que visam a obtenção de
vários parâmetros do reservatório (fator de película, volume poroso drenado, limites do
reservatório, etc).


<a id="org88f676b"></a>

# Versão:

-   1.0.


<a id="orgd4d0250"></a>

# Data:

-   2013/2 - segundo semestre.


<a id="org1af77a8"></a>

# Autor de Contato:

-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org204c5d8"></a>

# Lista dos Autores:

-   Letícia Fernandes Sakai
-   Lucas Rodrigues Tavares
-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org01fa11a"></a>

# Áreas de pesquisa vinculadas:

-   Modelagem Matemática Computacional
-   Engenharia de Reservatório


<a id="org5caae3d"></a>

# Vinculo com:

-   Trabalho da disciplina de programação prática.


<a id="orgd913721"></a>

# Paradigmas:

-   POO - Programação Orientada a Objeto (códigos em C++)


<a id="org6cd6f24"></a>

# Tipo de Interface:

-   Terminal e gráfica (gnuplot).


<a id="org3b57d41"></a>

# Plataformas Suportadas:

-   Windows e GNU/Linux e Mac OS X (não testada).


<a id="org25130dc"></a>

# Linguagens Utilizadas:

-   C++ 11.


<a id="orgd4116ea"></a>

# Bibliotecas Utilizadas (dependências):

-   CGnuplot - <https://github.com/ldsc/CGnuplot>


<a id="org1089257"></a>

# Softwares utilizados (dependências)

-   gnuplot <http://www.gnuplot.info/>


<a id="org8cee9f0"></a>

# Tipo de Licença:

-   GPL
-   Entre em contato com o Prof. André Duarte Bueno
    andreduartebueno@gmail.com
    para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
-   Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
-   Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
-   Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.


<a id="org424adf2"></a>

# Links:

